SIMISA@@@@@@@@@@JINX0D0t______
 
Wagon ( 42488T-B
    Type ( Engine )
    WagonShape ( ccw_br_4mt_42488_EC.s )
    Size  ( 2.687606m 3.855m 14.42424m )
    Mass ( 87.85t-uk )
	Coupling (
		Type ( Chain )
		Spring (
			Break ( 600kN 1000kN )
			r0 ( 18cm 0cm )
		)
	)

Comment( ********** Brakes, Type, Force, etc ***************        Included in this section - Type, Force, Reservoir, Applicatiion, Release. etc )

BrakeSystemType ( "Vacuum_single_pipe" )
MaxBrakeForce ( 241kN ) Comment(55% MT Weight*Cof 0.5)
MaxHandbrakeForce ( 88kN ) Comment(20% MTW*0.5)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg ) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)    

Comment( ******* Curve Resistance & SuperElevation *********                  Included in this section - Wheelbase, gauge, etc )

CentreOfGravity ( 0m 2.5m 0.06m )
Comment(0.06 to equalise front and rear coupling)
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 16.0ft 6in )
Comment(WheelBase = 1.25 x (axles-1) x Drive Diameter)

Comment( ***************** Friction*************************                   Included in this section - Friction, Bearing Type )

ORTSBearingType ( Friction )
Comment(CN 1990 DW x18)
ORTSDavis_A ( 5800 )
ORTSDavis_B ( 29.37 )
ORTSDavis_C ( 5.235 )

ORTSWagonFrontalArea (98ft^2)
ORTSDavisDragConstant (0.0024)

Comment( ******* Miscellaneous Wagon Information************                 Included in this section - Passenger View, Sounds, Freight Animations Intake Points for Tank Engine )

Comment ( ==Passenger View== )
	Inside (
       PassengerCabinFile (  ccw_br_4mt_42488_LC.s   )
       PassengerCabinHeadPos ( 1.5 3.0 -2 )
       RotationLimit ( 180 180 0 )
       StartDirection ( 0 0 0 )
    	)

FreightAnim ( "..\\common.headcodes\\CCW_Fairburn\\ccw_fairburn_HC_Class_B.s" 0 3.0 0.0 )

IntakePoint ( 0.7 8 FuelWater )
IntakePoint ( -3.85 8 FuelCoal )

Sound (	"..\\..\\Common.Steam\\2Cylinder\\L1eng.sms" )


Lights	( 9
		Light	(
			comment( Flickering firebox )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( -0 2.0 -2.5 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( -0 2.0 -2.5 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
									
								)
						)
			)
		Light	(
			comment( Cab glow )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff7200 )
					Position ( 0 2.2 -4.8 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1 )
					)
				)
			)
		Light	(
			comment( Flickering firebox )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( 0 2.1 -4.7 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( 0 2.1 -4.7 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				)
			)
		Light	(
			comment( flickering fire underneath LHS )
				Type		( 0 )
				Conditions	(
				Headlight ( 0 )
				TimeOfDay ( 2 )
				Unit ( 0 )
			)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle ( 0 )
				States	(	4
					State	(
						Duration ( 0.02 )
						LightColour ( aaffa200 )
						Position ( -0.5 0.9 -4.1 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 3 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffae00 )
						Position (-0.5 0.9 -4.1)
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 1 )
						)
					State	(
						Duration ( 0.03 )
						LightColour ( aaffa900 )
						Position (-0.5 0.9 -4.1 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 2 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffa000 )
						Position (-0.5 0.9 -4.1 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 4 )									)
				)
			)
		Light	(
			comment( flickering fire underneath RHS )
				Type		( 0 )
				Conditions	(
				Headlight ( 0 )
				TimeOfDay ( 2 )
				Unit ( 0 )
			)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle ( 0 )
				States	(	4
					State	(
						Duration ( 0.02 )
						LightColour ( aaffa200 )
						Position ( 0.5 0.9 -4.1 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 3 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffae00 )
						Position (0.5 0.9 -4.1)
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 3 )
						)
					State	(
						Duration ( 0.03 )
						LightColour ( aaffa900 )
						Position (0.5 0.9 -4.1 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 2 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffa000 )
						Position (0.5 0.9 -4.1 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 4 )									)
				)
			)
		Light	(
			comment( Front White Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 2 )
				)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( aaffffee )
						Position ( 0.0 3.35 6.1 )
						Azimuth ( 0.0 -5.0 5.0 )
						Transition ( 0 )
						Radius ( 0.55 )
					)
				)
			)
		Light	(
			comment( Front Red Reversed Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
				)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( 80ff0000 )
						Position ( 0.0 3.35 6.1 )
						Azimuth ( 0.0 -5.0 5.0 )
						Transition ( 0 )
						Radius ( 0.55 )
					)
				)
			)
		Light	(
			comment( Rear Red Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 3 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( 0 2.85 -6.83 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.55 )
				)
			)
		)
		Light	(
			comment( Rear White Reversed Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 5 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( aaffffee )
					Position ( 0 2.85 -6.83 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.55 )
				)
			)
		)
		)
	)
 
Engine ( 42488T-B
	Effects
	(
		SteamSpecialEffects
		(
			comment
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			WhistleFX
			(
				0.0 3.95 -2.1
				0 0.8 0
				0.35
			)

			SafetyValvesFX
			(
				0 3.90 -1.1
				0 0.6 0
				0.35
			)
			StackFX
			(
				0 3.8 4.7
				0 1 0
				0.2
			)

			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)

			CylindersFX
			(
				-1.2 0.65 5
				0 0.0875 1
				0.2
			)
			CylindersFX
			(
				1.2 0.65 5
				0 0.0875 1
				0.2
			)
			Injectors2FX
			(
			-1.026 0.85 -3.1
			0 -1 0
			0.15
			)
			Injectors1FX
			(
			1.026 0.85 -3.1
			0 -1 0
			0.15
			)

		)
	)

Wagon ( 42488T-B )
ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 29.5in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 52t-uk  )  
Sanding (25mph)
IsTenderRequired (0)

Comment(ORTSMaxIndicatedHorsepower ( 1120.0hp )) 
    
Comment ( *** Cylinders *** )
    NumCylinders ( 2 )
    CylinderStroke ( 26in ) 
    CylinderDiameter ( 19.625in ) 

Comment ( *** Boiler *** )
    ORTSSteamBoilerType ( Superheated )
    BoilerVolume ( 180*(ft^3) )     
    ORTSEvaporationArea ( 1366ft^2 )
    ORTSSuperheatArea ( 285ft^2 )
    MaxBoilerPressure ( 200psi )
    MaxSteamHeatingPressure ( 50psi )
    ORTSBoilerEvaporationRate ( 15 )
    ORTSMaxSuperheatTemperature ( 250.0 )


ORTSBoilerEfficiency( 0.0 0.905  190.0 0.4525 ) 
Comment(From 4MT Report)

Comment ( *** Fire *** ) 
    ORTSFuelCalorific ( 13700btu/lb )
    ORTSGrateArea ( 26.75ft^2 )
    SteamFiremanMaxPossibleFiringRate( 3000 ) 
    ShovelCoalMass ( 14lb )

ORTSBurnRate( 0.0 100.0   9000.0 1000.0   17500.0 2000.0  24000.0 3000.0   29000.0  4000.0  33000.0 5000.0 )

Comment ( *** Fuel *** )
    	MaxTenderCoalMass ( 3.5t-uk )
    	MaxTenderWaterMass ( 20000lb )
 
Comment ( == Brake valve == )   
	TrainBrakesControllerMinSystemPressure( 0 )
	TrainBrakesControllerMaxSystemPressure( 21 )
 	BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
 	BrakeSystemType ( "Vacuum_single_pipe" )


EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )

            Brake_Hand ( 0 1 0.0125 0
                NumNotches ( 0 )
            )
            FireDoor ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2
                NumNotches ( 0 )
            )
		 ORTSSteamHeat( 0 1 0.0125 0.5 )
            Shovel ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            DampersFront ( 0 1 0.1 1
                NumNotches ( 0 )
            )
            DampersBack ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector2Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

Sound (	"..\\..\\Common.Steam\\2Cylinder\\L1cab.sms" )

Cabview ( 5XP.cvf )
HeadOut (  -1.5 3.0 -2 )


Name ( "42488 Stanier Tank 4MT, Early Crest, Class B, TE 24.7Klbf" )

Description ("Sir William Stanier's (LMS) Class 4P 2-Cylinder 2-6-4T is a class of 206 steam locomotives built between 1935 and 1943. They were based on his LMS 3 Cylinder 2-6-4T.
The LMS numbered them 2425–94, and then 2537–672, BR adding 40000 to their numbers to make them 42425–94, and then 42537–672. The LMS classified them 4P, BR 4MT. They were the basis for the LMS Fairburn 2-6-4T.
Built by the LMS at Derby Works in April 1937, 42488 was allocated to Monument Lane 3E when transferred to British Railways stock in 1948. By 1951 she would be allocated to Walsall 3C where she would remain until being transferred back to Monument Lane 3E by 1960. By 1963 42488 would be allocated to Stafford 5C and then moved onto Bangor 7B by 1965 from where she was withdrawn from service in the February of this year. She was disposed of by Cashmore's of Great Bridge in May 1965. None of this class were saved for preservation.")
)
